{
  "lastUpdated": "2026-02-15T18:43:31.072920",
  "totalArticles": 5,
  "categories": [
    "Fundamentals",
    "Security Awareness",
    "Threat Analysis"
  ],
  "featuredArticles": [
    "analisi-header-email-phishing",
    "cos-e-il-phishing-tipologie-e-difesa"
  ],
  "articles": [
    {
      "id": "analisi-tecnica-phishing-spoofing-evasione",
      "title": "Analisi tecnica del phishing: Spoofing, protocolli e tecniche di evasione",
      "description": "Approfondimento tecnico sul phishing: analizziamo header email, spoofing, protocolli SPF/DKIM/DMARC e tecniche di evasione.",
      "categories": [
        "Security Awareness",
        "Threat Analysis"
      ],
      "category": "Security Awareness",
      "date": "2026-02-08",
      "readTime": "5 min",
      "author": "CybersecurityZen",
      "image": "assets/images/phishing-analysis.png",
      "tags": [
        "email headers",
        "phishing detection",
        "SPF",
        "DKIM",
        "DMARC",
        "email authentication",
        "threat analysis",
        "cybersecurity",
        "phishing",
        "security awareness",
        "social engineering"
      ],
      "content": "## Analisi Tecnica del Phishing: Sotto il cofano dell’attacco\n\n![Immagine di apertura](/assets/images/phishing-analysis.png)\n\nDopo aver compreso la psicologia dietro l'inganno, è necessario analizzare l'infrastruttura tecnologica che permette al phishing di circolare e le contromisure necessarie per neutralizzarlo. La sicurezza informatica non è un prodotto statico, ma un processo stratificato che unisce consapevolezza e strumenti tecnici.\n\nIl successo di un'email di phishing dipende spesso dalla sua capacità di superare i filtri di sicurezza (Antispam e Gateway). Per farlo, gli attaccanti manipolano i protocolli di comunicazione standard che regolano il funzionamento della posta elettronica.\n\n## Lo Spoofing dell'Header (Identità falsificata)\n\nIl protocollo **SMTP** (Simple Mail Transfer Protocol), pilastro della posta elettronica nato negli anni '80, è intrinsecamente insicuro poiché non richiede una verifica nativa dell'identità del mittente. Un attaccante può manipolare due diversi tipi di indirizzi:\n\n* **Envelope From (MAIL FROM):** L'indirizzo tecnico usato dai server per l'instradamento del messaggio.\n* **Header From (Friendly From):** L'indirizzo visualizzato nel tuo client (es. `sicurezza@paypal.it`).\n\nAnalizzando il codice sorgente (header) di un'email di phishing, si nota spesso che questi due campi non coincidono: l'attaccante usa un server autorizzato per l'invio, ma \"trucca\" l'intestazione visibile per ingannare la vittima.\n\n## La Triade della Difesa: SPF, DKIM e DMARC\n\nPer risolvere le vulnerabilità dell'SMTP, sono stati introdotti tre protocolli che lavorano in sinergia tramite i record DNS del dominio:\n\n| Protocollo | Funzione Principale | Metodo di Verifica |\n|:-----------|:--------------------|:-------------------|\n| **SPF (Sender Policy Framework)** | Autorizzazione IP   | Specifica quali indirizzi IP sono autorizzati a inviare email per conto di un dominio. |\n| **DKIM (DomainKeys Identified Mail)** | Integrità contenuto | Aggiunge una firma crittografica all'intestazione per garantire che il contenuto non sia stato alterato durante il transito. |\n| **DMARC (Domain-based Message Authentication, Reporting, and Conformance)** | Policy Decision     | Indica al server ricevente come gestire l'email (es. rifiutarla o metterla in quarantena) se i controlli SPF o DKIM falliscono. |\n\n```bash\n# Verifica del record SPF per identificare i server autorizzati\n# Questo comando mostra la lista di IP e domini che possono inviare mail\ndig txt google.com +short\n\n# Verifica della policy DMARC\n# Permette di capire se il dominio ha impostato \"reject\", \"quarantine\" o \"none\"\ndig txt _dmarc.microsoft.com +short\n```\n\n> **⚠️ Attenzione:** Molti attacchi moderni provengono da domini compromessi che hanno SPF e DKIM configurati correttamente. L'autenticazione da sola non è più una garanzia assoluta di sicurezza.\n\n## Tecniche di offuscamento ed evasione\n\nGli attaccanti utilizzano strategie avanzate per nascondere la destinazione reale dei link e bypassare i sistemi di analisi automatizzata (Sandbox).\n\n### 1. Attacchi Omografi (Punycode o Homograph Attack)\n\nSfruttano la somiglianza visiva tra caratteri di alfabeti diversi. Ad esempio, la \"o\" latina in `google.com` può essere sostituita con una \"о\" cirillica. Il browser interpreterà il dominio come `xn--ggle-46da.com`, ma l'utente vedrà un URL apparentemente legittimo.\n\nPuoi utilizzare questo script Python per rilevare potenziali attacchi omografi e verificare la sicurezza del protocollo:\n\n```Python\nimport urllib.parse\nimport idna\n\ndef analyze_phishing_url(url):\n    \"\"\"\n    Analizza un URL per rilevare potenziali attacchi omografi (Punycode)\n    o configurazioni di protocollo insicure.\n    \"\"\"\n    try:\n        parsed = urllib.parse.urlparse(url)\n        domain = parsed.netloc\n        \n        print(f\"\\n--- Report Analisi URL ---\")\n        print(f\"URL analizzato: {url}\")\n        print(f\"Protocollo:     {parsed.scheme.upper()}\")\n        print(f\"Dominio:        {domain}\")\n        \n        # Rilevamento Punycode (Homograph Attack)\n        if \"xn--\" in domain:\n            decoded_domain = idna.decode(domain)\n            print(f\"⚠️  ALLERTA PUNYCODE: Il dominio reale visualizzato è: {decoded_domain}\")\n        else:\n            print(\"✅ Il dominio non sembra utilizzare offuscamento Punycode.\")\n            \n        # Verifica crittografia (HTTPS)\n        if parsed.scheme != \"https\":\n            print(\"⚠️  AVVISO: L'URL non utilizza HTTPS. La connessione è insicura.\")\n            \n    except Exception as e:\n        print(f\"Errore durante l'analisi: {e}\")\n\n# Esempio di test con un dominio punycode\nanalyze_phishing_url(\"https://xn--pypal-4ve.com/login\")\n```\n\n### 2. Redirect a catena\n\nL'email punta a un URL legittimo (spesso un sito WordPress bucato) che contiene uno script di reindirizzamento verso la landing page finale. Questo \"spezza\" l'analisi automatizzata dei filtri.\n\n### 3. Cloaking e Anti-Sandbox\n\nI moderni kit di phishing includono script capaci di rilevare se il visitatore è un utente reale o un sistema di sicurezza:\n\n* **IP Blacklisting:** Se l'IP appartiene a società di cybersecurity (es. Cisco, FireEye, Google), il sito mostra una pagina innocua.\n* **Geofencing:** Il contenuto malevolo viene attivato solo se l'utente si connette da una specifica nazione.\n\n## Esempio di Analisi Header\n\nPuoi identificare un tentativo di spoofing analizzando i salti (hop) effettuati dall'email nel campo `Received`:\n\n```bash\n# Esempio di controllo record SPF via terminale\ndig txt esempio-dominio-phishing.it\n```\n\n```Python\ndef check_header_discrepancy(envelope_from, header_from):\n    \"\"\"Semplice logica di controllo tra mittente reale e dichiarato\"\"\"\n    if envelope_from != header_from:\n        print(\"Alert: Possibile spoofing dell'header rilevato!\")\n        return True\n    return False\n```\n\n## Strategie di difesa e contromisure\n\nLa difesa efficace combina strumenti tecnologici e abitudini di verifica rigorose.\n\n### 1. Difesa lato utente\n\nPrima di cliccare, è fondamentale eseguire tre controlli rapidi:\n\n1. **Diffida dell'urgenza:** Messaggi che forzano un'azione immediata sono quasi sempre truffe.\n2. **Verifica il mittente:** Controlla l'indirizzo email reale, non solo il nome visualizzato.\n3. **Ispeziona i link:** Passa il mouse sopra un link (senza cliccare) per visualizzare l'URL di destinazione reale.\n\n### 2. L'autenticazione a più fattori (MFA)\n\nL'MFA è la misura più efficace: anche con la tua password, un attaccante non potrebbe accedere senza il secondo fattore. È preferibile usare app come **Bitwarden** o **Google Authenticator** rispetto agli SMS.\n\n### 3. Cosa fare se hai abboccato\n\nSe hai inserito i tuoi dati su un sito sospetto, la velocità di reazione è fondamentale:\n\n1. **Cambio password immediato:** Modifica la password dell'account compromesso e attiva un Password Manager.\n2. **Revoca delle sessioni:** Disconnetti tutti i dispositivi dalle impostazioni di sicurezza dell'account.\n3. **Blocco finanziario:** Se hai fornito dati bancari, contatta immediatamente l'istituto per bloccare le carte.\n4. **Verifica dei permessi:** Controlla che non siano stati aggiunti indirizzi email di recupero o deleghe non autorizzate.\n\n## Conclusioni\n\nIl phishing è una minaccia in continua evoluzione. Comprendere i protocolli tecnici (SPF/DKIM/DMARC) e mantenere un sano scetticismo sono le armi migliori per proteggere la propria identità digitale e i propri dati aziendali.\n\n---\n\n*Se vuoi approfondire questi temi, hai domande su questo o altri argomenti, entra nella nostra community Discord: <i class=\"fab fa-discord\"></i><https://discord.gg/PE2q2jnNN6!>*\n",
      "draft": false,
      "featured": false
    },
    {
      "id": "introduzione-cybersecurity",
      "title": "Introduzione alla Cybersecurity: Concetti Fondamentali",
      "description": "Una guida introduttiva ai concetti base della sicurezza informatica per chi inizia",
      "categories": [
        "Fundamentals"
      ],
      "category": "Fundamentals",
      "date": "2026-02-06",
      "readTime": "2 min",
      "author": "CybersecurityZen",
      "image": "assets/images/introcybersec.png",
      "tags": [
        "cybersecurity",
        "fundamentals",
        "beginner"
      ],
      "content": "# Introduzione alla Cybersecurity\n\n![Introduzione alla CyberSecurity](/assets/images/introcybersec.png)\n\nLa **cybersecurity** (o sicurezza informatica) è l'insieme delle pratiche, tecnologie e processi progettati per proteggere sistemi, reti e dati da attacchi digitali.\n\nIn questo articolo esploreremo i concetti fondamentali che ogni aspirante professionista della sicurezza dovrebbe conoscere.\n\n## La Triade CIA\n\nIl modello fondamentale della sicurezza informatica si basa su tre principi, noti come **CIA Triad**:\n\n### Confidentiality (Riservatezza)\n\nGarantisce che le informazioni siano accessibili solo a chi è autorizzato. Tecniche comuni:\n\n- Crittografia dei dati\n- Controllo degli accessi\n- Autenticazione a più fattori (MFA)\n\n### Integrity (Integrità)\n\nAssicura che i dati non vengano modificati in modo non autorizzato. Strumenti utilizzati:\n\n- Hash crittografici (SHA-256, MD5)\n- Firme digitali\n- Controlli di versione\n\n### Availability (Disponibilità)\n\nI sistemi e i dati devono essere accessibili quando necessario. Strategie:\n\n- Backup regolari\n- Sistemi ridondanti\n- Protezione da attacchi DDoS\n\n## Tipi di Minacce\n\n| Tipo | Descrizione | Esempio |\n|------|-------------|---------|\n| Malware | Software malevolo | Virus, Ransomware, Trojan |\n| Phishing | Inganno per rubare credenziali | Email false della banca |\n| DDoS | Sovraccarico di un servizio | Attacco a siti web |\n| SQL Injection | Attacco a database | Manipolazione query |\n\n## Strumenti Base\n\nEcco alcuni strumenti che ogni professionista dovrebbe conoscere:\n\n```bash\n# Nmap - Scanner di rete\nnmap -sV -sC target.com\n\n# Wireshark - Analisi pacchetti\nwireshark\n\n# Hashcat - Password cracking (per test autorizzati)\nhashcat -m 0 hash.txt wordlist.txt\n```\n\n> **⚠️ Importante:** Utilizza questi strumenti solo su sistemi di cui hai l'autorizzazione esplicita. L'uso non autorizzato è illegale.\n\n## Prossimi Passi\n\nPer approfondire la cybersecurity, ti consiglio di:\n\n1. Studiare le basi di networking (TCP/IP, DNS, HTTP)\n2. Imparare un linguaggio di scripting (Python, Bash)\n3. Praticare su piattaforme legali come HackTheBox o TryHackMe\n4. Ottenere certificazioni entry-level (CompTIA Security+, CEH)\n\n## Conclusioni\n\nLa cybersecurity è un campo in continua evoluzione che richiede apprendimento costante. Partire dai fondamentali è essenziale per costruire competenze solide.\n\nNei prossimi articoli approfondiremo ciascuno di questi argomenti con guide pratiche e hands-on.\n\n---\n\n*Se vuoi approfondire questi temi, hai domande su questo o altri argomenti, entra nella nostra community Discord: <i class=\"fab fa-discord\"></i><https://discord.gg/PE2q2jnNN6!>*",
      "draft": false,
      "featured": false
    },
    {
      "id": "tipi-di-malware",
      "title": "Guida ai Malware: Tipologie, Funzionamento e Segnali d'Infezione",
      "description": "Scopri le diverse tipologie di malware, dai virus ai ransomware, e impara a riconoscere i sintomi di un sistema compromesso.",
      "categories": [
        "Fundamentals"
      ],
      "category": "Fundamentals",
      "date": "2026-02-06",
      "readTime": "2 min",
      "author": "CybersecurityZen",
      "image": "https://55e91930.delivery.rocketcdn.me/wp-content/uploads/2024/12/tipi-malware.png",
      "tags": [
        "cybersecurity",
        "fundamentals",
        "beginners",
        "malware"
      ],
      "content": "# Tipi di malware\n\n![tipi-di-malware](https://55e91930.delivery.rocketcdn.me/wp-content/uploads/2024/12/tipi-malware.png)\n\nScopri le diverse tipologie di malware, dai virus ai ransomware, e impara a riconoscere i sintomi di un sistema compromesso.\n\n## Guida ai Malware: Tipologie e Funzionamento\n\nEsistono numerose varianti di software malevolo, ognuna con obiettivi e comportamenti specifici.\n\n## Spyware e Adware\n\n* **Spyware:** Progettato per monitorare l'attività online, registrare i tasti premuti (keylogging) e catturare dati sensibili come le credenziali bancarie.\n* **Adware:** Spesso installato insieme a software legittimo, visualizza banner e pop-up pubblicitari indesiderati.\n\n## Backdoor e Rootkit\n\nQuesti malware mirano a garantire l'accesso persistente al sistema.\n\n* **Backdoor:** Aggira le normali procedure di autenticazione per consentire l'accesso remoto non autorizzato.\n* **Rootkit:** Modifica il sistema operativo per nascondere la propria presenza e creare backdoor, operando spesso con privilegi elevati.\n\n>**⚠️Attenzione:** Nella maggior parte dei casi, un computer infettato da un rootkit deve essere formattato e tutto il software deve essere reinstallato da zero.\n\n## Ransomware e Scareware\n\n* **Ransomware:** Crittografa i dati dell'utente e richiede un riscatto per la decifratura. Si diffonde spesso tramite e-mail di phishing o vulnerabilità software.\n* **Scareware:** Utilizza tattiche di \"spavento\", come finti avvisi del sistema operativo, per indurre l'utente a installare software malevolo convinto di stare \"pulendo\" il PC.\n\n## Virus, Worm e Trojan: Quali differenze?\n\nSebbene vengano spesso usati come sinonimi, questi malware hanno caratteristiche tecniche molto diverse:\n\n|Tipo|Richiede host?|Si Autoreplica?|Caratteristica Principale|\n|------|------|------|------|\n|**Virus**|Si|Si|Si attacca a file eseguibili legittimi|\n|**Worm**|No|Si|Sfrutta la rete oer diffondersi autonomamente|\n|**Trojan**|No|No|Si maschera da software utile per ingannare l'utente|\n\n### Focus sul codice\n\nAd esempio, un worm può essere scriptato per cercare vulnerabilità di rete in modo automatizzato:\n\n```bash\n# Esempio concettuale di scansione rete per vulnerabilità (uso difensivo)\nnmap -sV --script vuln 192.168.1.0/24\n```\n\n### Sintomi comuni di infezione\n\nIndipendentemente dal tipo di malware, ci sono alcuni \"campanelli d'allarme\" che indicano un sistema compromesso:\n\n* **Prestazioni:** Aumento improvviso dell'utilizzo della CPU e rallentamenti generali.\n* **Stabilità:** Il computer si blocca spesso o presenta schermate blu.\n* **Rete:** Riduzione della velocità di navigazione o connessioni inspiegabili.\n* **Integrità:** File modificati, cancellati o comparsa di icone sconosciute sul desktop.\n* **Anomalie:** Programmi che si disattivano da soli o invio di e-mail non autorizzate.\n\n> **💡 Nota:** Se noti processi sconosciuti in esecuzione nel Task Manager (Gestione Attività), esegui immediatamente una scansione con un antivirus aggiornato.\n\n## Conclusioni\n\nIl panorama dei malware è in continua evoluzione, ma la maggior parte delle infezioni richiede ancora un'azione dell'utente o la presenza di software non aggiornato per avere successo. Mantenere i sistemi patchati e prestare attenzione agli allegati e-mail rimangono le migliori difese.\n\n---\n\n*Se vuoi approfondire questi temi, hai domande su questo o altri argomenti, entra nella nostra community Discord: <i class=\"fab fa-discord\"></i><https://discord.gg/PE2q2jnNN6!>*\n",
      "draft": false,
      "featured": false
    },
    {
      "id": "analisi-header-email-phishing",
      "title": "Analisi degli Header Email: Guida Completa per Identificare il Phishing",
      "description": "Impara a leggere e analizzare gli header delle email per riconoscere tentativi di phishing, spoofing e altre minacce. Una guida tecnica dettagliata con esempi pratici.",
      "categories": [
        "Security Awareness",
        "Threat Analysis"
      ],
      "category": "Security Awareness",
      "date": "2026-02-15",
      "readTime": "11 min",
      "author": "CybersecurityZen",
      "image": "assets/images/phishing-analysis.png",
      "tags": [
        "email headers",
        "phishing detection",
        "SPF",
        "DKIM",
        "DMARC",
        "email authentication",
        "threat analysis"
      ],
      "content": "# Analisi degli Header Email: Guida Completa per Identificare il Phishing\n\n> **Questo articolo fa parte di una serie sul phishing.** Se non l'hai ancora fatto, ti consiglio di leggere prima [Cos'è il Phishing: Tipologie e Difesa](/articles/cos-e-il-phishing-tipologie-e-difesa.html) per una panoramica introduttiva, e [Analisi Tecnica: Phishing, Spoofing ed Evasione](/articles/analisi-tecnica-phishing-spoofing-evasione.html) per comprendere le tecniche utilizzate dagli attaccanti.\n\nGli header delle email rappresentano il \"DNA\" di ogni messaggio di posta elettronica. Contengono informazioni cruciali sul percorso del messaggio, l'autenticità del mittente e numerosi metadati che possono rivelare tentativi di phishing, spoofing o altre attività malevole. In questa guida approfondita, esploreremo ogni campo degli header email e come utilizzarli per proteggere te stesso e la tua organizzazione.\n\n## Cosa Sono gli Header Email?\n\nGli header email sono una sezione di metadati invisibile all'utente comune, posizionata all'inizio di ogni messaggio di posta elettronica. Mentre il destinatario vede solo il corpo del messaggio, i campi \"Da\", \"A\" e \"Oggetto\", gli header contengono decine di righe di informazioni tecniche che documentano l'intero viaggio del messaggio dal mittente al destinatario.\n\nOgni server di posta che elabora il messaggio aggiunge le proprie informazioni agli header, creando una traccia dettagliata che può essere analizzata per verificare l'autenticità del messaggio.\n\n## Come Visualizzare gli Header Email\n\nPrima di analizzare gli header, è necessario sapere come accedervi nei principali client di posta:\n\n**Gmail**: Apri l'email → Clicca sui tre puntini verticali → \"Mostra originale\"\n\n**Outlook (Web)**: Apri l'email → Clicca sui tre puntini → \"Visualizza\" → \"Visualizza origine messaggio\"\n\n**Outlook (Desktop)**: Apri l'email → File → Proprietà → \"Intestazioni Internet\"\n\n**Thunderbird**: Apri l'email → Visualizza → Sorgente del messaggio (Ctrl+U)\n\n**Apple Mail**: Apri l'email → Visualizza → Messaggio → Intestazioni complete\n\n---\n\n## Anatomia Completa degli Header Email\n\n### 1. Received (Il Campo Più Importante)\n\nIl campo `Received` è probabilmente il più critico per l'analisi forense delle email. Ogni server di posta che gestisce il messaggio aggiunge una riga \"Received\" in cima agli header esistenti. Questo significa che **gli header Received vanno letti dal basso verso l'alto** per seguire il percorso cronologico del messaggio.\n\n**Struttura tipica:**\n\n```\nReceived: from mail-server.example.com (mail-server.example.com [93.184.216.34])\n        by mx.recipient.com (Postfix)\n        with ESMTPS id ABC123DEF456\n        for <destinatario@recipient.com>;\n        Sat, 15 Feb 2025 10:30:45 +0100 (CET)\n```\n\n**Elementi da analizzare:**\n\n| Elemento | Descrizione | Cosa Verificare |\n|----------|-------------|-----------------|\n| `from` | Server mittente dichiarato | Deve corrispondere al dominio del mittente |\n| `(hostname [IP])` | Hostname e IP reali | Verifica con reverse DNS lookup |\n| `by` | Server ricevente | Il tuo server di posta |\n| `with` | Protocollo utilizzato | ESMTPS indica connessione cifrata |\n| `for` | Destinatario | Deve essere il tuo indirizzo |\n| `timestamp` | Data e ora | Sequenza cronologica coerente |\n\n**🚨 Red Flags da Cercare:**\n\n- **IP che non corrisponde al dominio dichiarato**: Se l'email dichiara di provenire da `paypal.com` ma l'IP risolve a un server in un paese improbabile, è sospetto\n- **Salti geografici illogici**: Un'email da una banca italiana che passa per server in Russia o Cina\n- **Timestamp inconsistenti**: Date fuori sequenza o nel futuro\n- **Hostname generici**: Server come `vps12345.cheaphosting.com` per email \"aziendali\"\n- **Assenza di crittografia**: `with SMTP` invece di `with ESMTPS` per comunicazioni sensibili\n\n**Esempio di Header Received Sospetto:**\n\n```\nReceived: from smtp.paypal.com (unknown [185.234.xx.xx])\n        by mail.attacker-server.ru\n        with SMTP\n```\n\nQui vediamo che il server dichiara di essere `smtp.paypal.com`, ma:\n\n- L'IP reale è contrassegnato come \"unknown\"\n- Passa attraverso un server russo\n- Non usa connessione cifrata (SMTP semplice)\n\n---\n\n### 2. From (Mittente)\n\n```\nFrom: \"Servizio Clienti PayPal\" <security@paypal.com>\n```\n\nIl campo `From` mostra il mittente come appare al destinatario. È composto da due parti:\n\n- **Display Name**: Il nome visualizzato (\"Servizio Clienti PayPal\")\n- **Email Address**: L'indirizzo effettivo (<security@paypal.com>)\n\n**🚨 Red Flags:**\n\n- **Discrepanza nome/indirizzo**: `\"Amazon Support\" <support@amaz0n-security.com>`\n- **Domini simili ma diversi** (typosquatting):\n  - `paypa1.com` invece di `paypal.com`\n  - `arnazon.com` invece di `amazon.com`\n  - `microsoftonline-login.com` invece di `microsoft.com`\n- **Domini gratuiti per comunicazioni aziendali**: `amazon.support@gmail.com`\n- **Sottodomini ingannevoli**: `paypal.com.malicious-site.com`\n\n**Importante**: Il campo `From` è facilmente falsificabile (spoofing). Non basare mai la verifica solo su questo campo.\n\n---\n\n### 3. Return-Path (Envelope Sender)\n\n```\nReturn-Path: <bounce-handler@real-sender.com>\n```\n\nIl `Return-Path` indica dove vengono inviate le notifiche di mancata consegna (bounce). In email legittime, dovrebbe corrispondere al dominio del mittente.\n\n**🚨 Red Flags:**\n\n- **Dominio completamente diverso dal From**: Se `From` è `@paypal.com` ma `Return-Path` è `@random-server.xyz`\n- **Indirizzi usa e getta**: Domini appena registrati o servizi temporanei\n- **Assenza del campo**: Alcune email di phishing omettono questo campo\n\n---\n\n### 4. Reply-To\n\n```\nReply-To: response@different-domain.com\n```\n\nSpecifica dove verranno inviate le risposte. Nelle email legittime, solitamente corrisponde al mittente o a un indirizzo correlato.\n\n**🚨 Red Flags:**\n\n- **Dominio diverso dal mittente**: Email \"da\" una banca con reply-to su Gmail\n- **Indirizzi generici sospetti**: `claims@gmail.com`, `support123@yahoo.com`\n- **Tentativo di catturare risposte**: L'attaccante vuole che tu risponda a un indirizzo controllato da lui\n\n---\n\n### 5. Message-ID\n\n```\nMessage-ID: <1234567890.123456.789@mail.legitimate-company.com>\n```\n\nIdentificatore univoco del messaggio generato dal server di origine. Il dominio dopo la `@` dovrebbe corrispondere al server mittente.\n\n**🚨 Red Flags:**\n\n- **Dominio non correlato al mittente**: Message-ID con dominio diverso dall'organizzazione dichiarata\n- **Formato anomalo**: ID troppo semplici o pattern non standard\n- **ID duplicati**: Lo stesso Message-ID usato per email diverse (indica automazione malevola)\n\n---\n\n### 6. X-Originating-IP\n\n```\nX-Originating-IP: [192.168.1.100]\n```\n\nAlcuni provider (come Outlook/Hotmail) includono l'IP originale del mittente. Questo campo può rivelare la vera origine geografica del messaggio.\n\n**Come Analizzarlo:**\n\n1. Copia l'indirizzo IP\n2. Usa servizi come `whatismyipaddress.com` o `ipinfo.io` per geolocalizzarlo\n3. Confronta con la presunta origine del messaggio\n\n**🚨 Red Flags:**\n\n- **Localizzazione inaspettata**: Un'email dalla tua banca italiana originata da un IP nigeriano o cinese\n- **IP di VPN/Tor noti**: Indica tentativi di anonimizzazione\n- **IP residenziali per comunicazioni aziendali**: Le aziende usano IP statici aziendali\n\n---\n\n## Campi di Autenticazione Email\n\nQuesti campi sono fondamentali per verificare l'autenticità di un'email. Rappresentano i tre pilastri della sicurezza email moderna.\n\n### 7. SPF (Sender Policy Framework)\n\n```\nReceived-SPF: pass (google.com: domain of info@legitimate-company.com \n              designates 209.85.220.41 as permitted sender)\n```\n\nSPF verifica che il server che invia l'email sia autorizzato dal dominio del mittente. Il dominio pubblica un record DNS TXT che elenca i server autorizzati a inviare email per suo conto.\n\n**Possibili risultati:**\n\n| Risultato | Significato | Rischio |\n|-----------|-------------|---------|\n| `pass` | Server autorizzato | ✅ Basso |\n| `fail` | Server NON autorizzato | 🚨 Alto - Probabile spoofing |\n| `softfail` | Probabilmente non autorizzato | ⚠️ Medio - Sospetto |\n| `neutral` | Nessuna policy definita | ⚠️ Medio - Inconcludente |\n| `none` | Nessun record SPF | ⚠️ Medio - Configurazione mancante |\n| `temperror` | Errore temporaneo DNS | Riprovare |\n| `permerror` | Errore nella sintassi SPF | Configurazione errata |\n\n**🚨 Red Flags:**\n\n- **`fail` su email che dichiarano di provenire da grandi aziende**: Tutte le grandi aziende hanno SPF configurato\n- **`none` per banche o istituzioni finanziarie**: Improbabile che non abbiano SPF\n\n---\n\n### 8. DKIM (DomainKeys Identified Mail)\n\n```\nDKIM-Signature: v=1; a=rsa-sha256; c=relaxed/relaxed;\n        d=legitimate-company.com; s=selector1;\n        h=from:to:subject:date:message-id;\n        bh=abc123...;\n        b=xyz789...\n```\n\nDKIM aggiunge una firma crittografica all'email. Il server ricevente può verificare questa firma usando la chiave pubblica nel DNS del dominio mittente.\n\n**Elementi chiave:**\n\n| Parametro | Descrizione |\n|-----------|-------------|\n| `d=` | Dominio che ha firmato (deve corrispondere al From) |\n| `s=` | Selettore per trovare la chiave pubblica |\n| `h=` | Header inclusi nella firma |\n| `b=` | La firma digitale effettiva |\n| `bh=` | Hash del corpo del messaggio |\n\n**Verifica DKIM (Authentication-Results):**\n\n```\nAuthentication-Results: mx.google.com;\n       dkim=pass header.d=legitimate-company.com\n```\n\n**🚨 Red Flags:**\n\n- **`dkim=fail`**: La firma non è valida - il messaggio potrebbe essere stato modificato o è falsificato\n- **Dominio `d=` diverso dal From**: Discrepanza tra chi firma e chi dichiara di inviare\n- **Assenza di DKIM per grandi organizzazioni**: La maggior parte delle aziende serie usa DKIM\n\n---\n\n### 9. DMARC (Domain-based Message Authentication)\n\n```\nAuthentication-Results: mx.google.com;\n       dmarc=pass (p=REJECT sp=REJECT dis=NONE) header.from=legitimate-company.com\n```\n\nDMARC unifica SPF e DKIM, definendo cosa fare con le email che falliscono i controlli.\n\n**Policy DMARC:**\n\n| Policy | Azione |\n|--------|--------|\n| `p=none` | Solo monitoraggio, nessun blocco |\n| `p=quarantine` | Email sospette vanno in spam |\n| `p=reject` | Email non autenticate rifiutate |\n\n**🚨 Red Flags:**\n\n- **`dmarc=fail` con email \"importanti\"**: Banche, PayPal, Amazon hanno tutti `p=reject`\n- **Assenza di DMARC per istituzioni finanziarie**: Estremamente sospetto\n\n---\n\n### 10. Authentication-Results (Sommario)\n\nQuesto header riassume tutti i controlli di autenticazione:\n\n```\nAuthentication-Results: mx.google.com;\n       spf=pass (google.com: domain of info@company.com designates \n           209.85.220.41 as permitted sender) smtp.mailfrom=info@company.com;\n       dkim=pass header.d=company.com header.s=selector1 header.b=abc123;\n       dmarc=pass (p=REJECT sp=REJECT) header.from=company.com\n```\n\n**Email Legittima**: Tutti e tre `pass`\n**Email Sospetta**: Uno o più `fail` o `softfail`\n\n---\n\n## Altri Header Importanti\n\n### 11. X-Mailer / User-Agent\n\n```\nX-Mailer: Microsoft Outlook 16.0\nUser-Agent: Mozilla Thunderbird 102.0\n```\n\nIndica il software usato per comporre l'email.\n\n**🚨 Red Flags:**\n\n- **Script o bot**: `X-Mailer: PHPMailer 6.0.0` per \"email personali\"\n- **Inconsistenze**: Email \"da iPhone\" con X-Mailer di Outlook\n- **Versioni obsolete o inesistenti**: Software non più esistente\n\n---\n\n### 12. X-Priority / Importance\n\n```\nX-Priority: 1 (Highest)\nImportance: High\n```\n\nIndica la priorità del messaggio.\n\n**🚨 Red Flags:**\n\n- **Priorità alta su email non sollecitate**: Tattica per creare urgenza\n- **Combinato con oggetti allarmisti**: \"URGENTE: Il tuo account sarà sospeso\"\n\n---\n\n### 13. Content-Type\n\n```\nContent-Type: multipart/mixed; boundary=\"----=_Part_123456\"\nContent-Type: text/html; charset=\"UTF-8\"\n```\n\nSpecifica il formato del contenuto del messaggio.\n\n**🚨 Red Flags:**\n\n- **HTML nascosto in email \"plain text\"**: Potrebbe contenere link mascherati\n- **Allegati sospetti**: `application/x-msdownload`, `.exe`, `.scr`, `.vbs`\n\n---\n\n### 14. X-Spam-Status e X-Spam-Score\n\n```\nX-Spam-Status: No, score=-2.0 required=5.0\nX-Spam-Score: -2.0\n```\n\nValutazione antispam del server ricevente. Score negativi indicano email più probabilmente legittime.\n\n---\n\n## Checklist Pratica di Analisi\n\nQuando analizzi un'email sospetta, segui questa checklist:\n\n### ✅ Verifica di Base\n\n- [ ] Il dominio del mittente è scritto correttamente? (no typosquatting)\n- [ ] From, Return-Path e Reply-To sono coerenti?\n- [ ] Il Message-ID corrisponde al dominio mittente?\n\n### ✅ Analisi del Percorso (Received Headers)\n\n- [ ] Leggi i Received dal basso verso l'alto\n- [ ] Gli IP corrispondono ai domini dichiarati?\n- [ ] Il percorso geografico è logico?\n- [ ] I timestamp sono in sequenza?\n- [ ] È stata usata crittografia (ESMTPS)?\n\n### ✅ Autenticazione\n\n- [ ] SPF: pass?\n- [ ] DKIM: pass con dominio corretto?\n- [ ] DMARC: pass?\n- [ ] Tutti e tre i controlli superati?\n\n### ✅ Red Flags Generali\n\n- [ ] Urgenza eccessiva nel messaggio?\n- [ ] Richiesta di informazioni sensibili?\n- [ ] Link che non corrispondono al testo visualizzato?\n- [ ] Allegati non richiesti?\n- [ ] Errori grammaticali o di formattazione?\n\n---\n\n## Strumenti Utili per l'Analisi\n\n### Strumenti Online\n\n1. **MXToolbox Header Analyzer** - `mxtoolbox.com/EmailHeaders.aspx`\n   - Analisi completa e visualizzazione del percorso\n\n2. **Google Admin Toolbox** - `toolbox.googleapps.com/apps/messageheader`\n   - Ottimo per visualizzare il flusso temporale\n\n3. **Mail Header Analyzer** - `mailheader.org`\n   - Interfaccia semplice, analisi dettagliata\n\n### Verifiche DNS\n\n1. **SPF Record Check**: `dig TXT dominio.com` o `nslookup -type=TXT dominio.com`\n2. **DKIM Record Check**: `dig TXT selector._domainkey.dominio.com`\n3. **DMARC Record Check**: `dig TXT _dmarc.dominio.com`\n\n### Verifica IP\n\n1. **IPInfo.io**: Geolocalizzazione e informazioni sul provider\n2. **AbuseIPDB**: Verifica se l'IP è stato segnalato per attività malevole\n3. **VirusTotal**: Analisi di URL e IP sospetti\n\n---\n\n## Esempi Pratici\n\n### Esempio 1: Email Legittima\n\n```\nReturn-Path: <noreply@paypal.com>\nReceived: from mx1.paypal.com (mx1.paypal.com [66.211.168.123])\n        by mx.gmail.com with ESMTPS\n        for <utente@gmail.com>;\n        Sat, 15 Feb 2025 10:00:00 -0800\nFrom: \"PayPal\" <noreply@paypal.com>\nAuthentication-Results: mx.google.com;\n       spf=pass (domain of paypal.com designates 66.211.168.123 as permitted)\n       dkim=pass header.d=paypal.com\n       dmarc=pass (p=REJECT)\nMessage-ID: <123456789@paypal.com>\n```\n\n**Analisi**: ✅ Tutti gli indicatori sono positivi. SPF, DKIM e DMARC passano. Gli IP e i domini sono coerenti.\n\n### Esempio 2: Email di Phishing\n\n```\nReturn-Path: <bounce@mail-server-xyz.ru>\nReceived: from smtp.paypal.com (unknown [185.234.72.xxx])\n        by mail-server-xyz.ru with SMTP\n        for <utente@gmail.com>;\n        Sat, 15 Feb 2025 18:00:00 +0300\nFrom: \"PayPal Security Team\" <security@paypa1-secure.com>\nReply-To: paypal.verify@gmail.com\nAuthentication-Results: mx.google.com;\n       spf=fail\n       dkim=none\n       dmarc=fail\nMessage-ID: <random123@unknown-server.net>\n```\n\n**Analisi**: 🚨 Multipli red flags:\n\n- Return-Path su dominio russo\n- IP non corrisponde a PayPal\n- Dominio \"paypa1\" con numero 1 invece di \"l\"\n- Reply-To su Gmail (una banca non usa Gmail)\n- SPF e DMARC falliti\n- Nessuna firma DKIM\n- Message-ID su server sconosciuto\n- Connessione non cifrata (SMTP semplice)\n\n---\n\n## Conclusioni\n\nL'analisi degli header email è una competenza fondamentale per chiunque voglia proteggersi dal phishing. Mentre i controlli automatici (SPF, DKIM, DMARC) filtrano molte minacce, comprendere come leggere gli header ti permette di identificare anche attacchi sofisticati che potrebbero eludere i filtri.\n\nRicorda sempre:\n\n- **Non fidarti mai solo del campo \"From\"**: è facilmente falsificabile\n- **Verifica sempre i tre pilastri**: SPF, DKIM e DMARC\n- **Analizza il percorso**: i campi Received raccontano la vera storia\n- **In caso di dubbio, non cliccare**: contatta direttamente l'organizzazione tramite canali ufficiali\n\nLa sicurezza email è una responsabilità condivisa. Più persone sanno riconoscere il phishing, più sicuro diventa l'ecosistema per tutti.\n\n---\n\n## Articoli Correlati\n\nQuesta guida fa parte di una serie completa sul phishing. Per approfondire l'argomento, consulta gli altri articoli:\n\n1. **[Cos'è il Phishing: Tipologie e Difesa](/articles/cos-e-il-phishing-tipologie-e-difesa.html)** - Introduzione al fenomeno del phishing, le diverse tipologie di attacco e le strategie di difesa fondamentali.\n\n2. **[Analisi Tecnica: Phishing, Spoofing ed Evasione](/articles/analisi-tecnica-phishing-spoofing-evasione.html)** - Approfondimento sulle tecniche utilizzate dagli attaccanti per falsificare l'identità del mittente e aggirare i sistemi di sicurezza.\n\n3. **Analisi degli Header Email** *(questo articolo)* - Guida pratica all'analisi forense degli header per identificare email fraudolente.\n\n---\n\n*Ultimo aggiornamento: Febbraio 2025*\n",
      "draft": false,
      "featured": true
    },
    {
      "id": "cos-e-il-phishing-tipologie-e-difesa",
      "title": "L'arte dell'inganno: guida completa al phishing e alle sue varianti moderne",
      "description": "Guida completa al Phishing: scopri varianti, esempi pratici e tecniche di difesa. Impara a riconoscere le minacce digitali e proteggi i tuoi dati sensibili.",
      "categories": [
        "Security Awareness"
      ],
      "category": "Security Awareness",
      "date": "2026-02-08",
      "readTime": "7 min",
      "author": "CybersecurityZen",
      "image": "https://www.malwarebytes.com/wp-content/uploads/sites/2/2024/05/phishing.webp?w=1024",
      "tags": [
        "email headers",
        "phishing detection",
        "SPF",
        "DKIM",
        "DMARC",
        "email authentication",
        "threat analysis",
        "cybersecurity",
        "phishing",
        "security awareness",
        "social engineering"
      ],
      "content": "## Introduzione: L’arte dell’inganno digitale\n\n![Immagine di apertura](https://www.malwarebytes.com/wp-content/uploads/sites/2/2024/05/phishing.webp?w=1024)\n\nUn’analisi dettagliata sul phishing, l’arma preferita del social engineering. Dalle basi per principianti agli approfondimenti tecnici per esperti, esploriamo ogni variante — come Smishing, Vishing e Quishing — con esempi reali e strategie efficaci per non cadere mai più in trappola.\n\n### 1. Cos'è veramente il phishing\n\nNonostante il termine evochi scenari tecnologici complessi, il phishing è, nella sua essenza, una forma di **Ingegneria Sociale (Social Engineering).** Non si tratta di hackerare un computer tramite codice maligno, ma di \"hackerare\" la mente umana.\n\nIl nome stesso deriva dal termine inglese *fishing* (pescare): l'attaccante lancia un \"amo\" (un'email, un SMS, un link) sperando che qualcuno \"abbocchi\". L'obiettivo è quasi sempre il medesimo: sottrarre informazioni sensibili come credenziali di accesso, numeri di carte di credito o dati aziendali riservati, inducendo la vittima a compiere un'azione (cliccare, scaricare, rispondere) in modo volontario ma inconsapevole.\n\n### 2. Dall'amo alla rete: L'evoluzione storica\n\nIl phishing non è un fenomeno nuovo, ma la sua metamorfosi è stata radicale:\n\n* **Le origini (anni '90):** I primi attacchi avvenivano su piattaforme come AOL. Erano rudimentali, pieni di errori grammaticali e venivano inviati a tappeto a milioni di utenti (Mass Phishing), sperando in una percentuale di successo minima.\n* **L'era della personalizzazione:** Con l'esplosione dei social network, gli attaccanti hanno iniziato a studiare le vittime. Le esche sono diventate credibili, replicando perfettamente il layout di banche, corrieri o servizi cloud (come Microsoft 365).\n* **Oggi e il futuro (L'era dell'IA):** Siamo entrati in una fase critica. Grazie all'Intelligenza Artificiale Generativa, i messaggi di phishing sono ora scritti in un linguaggio perfetto, senza errori di sintassi. Non solo: l'IA permette di creare Deepfake audio e video, rendendo possibile truffe che sembrano provenire direttamente dalla voce di un superiore o di un familiare.\n\n### 3. Il \"fattore umano\": Perché funziona ancora\n\nMolti si chiedono: *\"Come è possibile cadere in trappole così banali, ancora oggi?\"*. La risposta risiede nella nostra psicologia. Il phishing non colpisce la nostra logica, ma i nostri istinti primordiali attraverso diverse \"leve\":\n\n1. **L'urgenza:** *\"Il tuo conto verrà bloccato entro 2 ore\"*. La fretta impedisce al nostro cervello di analizzare i dettagli tecnici del messaggio. In questo modo non si notato quei dettagli tecnici che in uno stato di normalità una persona noterebbe o andrebbe a ricercare.\n2. **L'autorità:** Un'email che sembra provenire dall'Agenzia delle Entrate o dal CEO dell'azienda inibisce il nostro spirito critico.\n3. **La paura o il desiderio:** La paura di una sanzione o l'entusiasmo per un premio inaspettato, o magari tanto desiderato, ci spingono ad agire impulsivamente.\n\n## Il meccanismo psicologico: Perché cadiamo nella trappola\n\nIl phishing non sfrutta bug nel software, ma \"bug\" nel sistema operativo umano. Gli attaccanti utilizzano tecniche di **Ingegneria Sociale** per bypassare il nostro pensiero critico e attivare una risposta emotiva immediata.\n\n### 1. Le leve emotive (trigger)\n\nPer indurre una persona a compiere un'azione imprudente, i criminali utilizzano principalmente quattro leve psicologiche:\n\n* **Urgenza:** È la leva più comune. *\"Il tuo account scadrà tra 30 minuti\"*. L'urgenza crea ansia e spinge il cervello a scegliere la via più rapida (cliccare) invece di quella più analitica (verificare).\n* **Autorità:** Ricevere un'email dal \"Direttore IT\", dall' \"Agenzia delle Entrate\" o dalle \"Forze dell'Ordine\" attiva in noi un senso di deferenza e obbedienza, rendendoci meno propensi a mettere in dubbio la richiesta.\n* **Paura:** *\"Rilevato accesso non autorizzato dalla Russia\"*. La paura di perdere denaro o l'accesso ai propri dati attiva il sistema limbico, che mette in \"stand-by\" la parte razionale della mente.\n* **Curiosità o Avidità:** *\"Guarda le foto dell'ultima festa!\"* o *\"Hai vinto un iPhone 15\"*. Queste esche giocano sul desiderio di non perdere un'opportunità o sulla semplice curiosità umana.\n\n### 2. Anatomia di un attacco standard\n\nUn attacco di phishing non è un evento isolato, ma un processo strutturato in tre fasi distinte. Visualizzarlo come una catena aiuta a capire dove è possibile spezzarla.\n\n1. **L'Esca (The Bait):** L'attaccante prepara il materiale. Crea un'email che imita perfettamente il branding di un'azienda nota (colori, loghi, font) e registra un dominio simile a quello originale (es. `assistenza-paypal.it` invece di `paypal.it`).\n2. **Il Trasporto (The Delivery):** Il messaggio viene inviato tramite il canale scelto (Email, SMS, Social). In questa fase, l'obiettivo è superare i filtri antispam e arrivare agli occhi della vittima.\n3. **Il Payload o Sito Civetta (The Hook):** Una volta che l'utente clicca sul link, viene portato su una **Landing Page** (pagina di atterraggio) contraffatta. Qui viene chiesto di inserire le credenziali. Nel momento in cui premi \"Invia\", i tuoi dati non vanno alla banca, ma direttamente nel database del criminale.\n\n### 3. L'effetto \"falso senso di sicurezza\"\n\nSpesso gli esperti cadono nel phishing perché pensano di essere immuni. I moderni attacchi sono estremamente sofisticati: usano certificati HTTPS (il lucchetto verde non è più garanzia di sicurezza!) e script che verificano se l'utente sta navigando da un dispositivo reale o da una sandbox di sicurezza, nascondendo il contenuto malevolo nel secondo caso.\n\n## Le varianti del phishing\n\nSe il phishing classico è una rete gettata nel mucchio, le sue varianti sono strumenti di precisione chirurgica. Ecco come si presentano oggi le diverse facce dell'inganno.\n\n### 1. Phishing basato sui canali di comunicazione\n\n* **Email Phishing (Il Classico):** Campagne massive inviate a migliaia di indirizzi. Spesso includono loghi contraffatti di brand famosi (Amazon, Netflix, Apple) e chiedono di \"aggiornare i dati di pagamento\".\n* **Smishing (SMS Phishing):** L'attacco arriva via SMS. È pericoloso perché sugli smartphone tendiamo a essere meno sospettosi.\n\n  ![Immagine esempio smishing](https://media-assets.wired.it/photos/618ce4a72b41138e2b5acd5c/master/w_1600%2Cc_limit/1539678277_sms_truffa_amazon.jpg) *Esempio di smishing preso da Wired.it*\n\n* **Vishing (Voice Phishing):** Una telefonata da un presunto operatore di banca o supporto tecnico. Oggi i criminali usano l'IA per il **deepfake audio**, clonando perfettamente la voce di un dirigente o di un conoscente.\n\n### 2. Attacchi mirati\n\n* **Spear Phishing:** A differenza del phishing generico, qui l'attaccante conosce il tuo nome, il tuo ruolo e i tuoi colleghi. È un attacco studiato nei minimi dettagli per colpire un singolo individuo o una specifica azienda.\n* **Whaling (Caccia alla Balena):** È uno spear phishing rivolto ai \"pesci grossi\": CEO, CFO o alti dirigenti. L'obiettivo è autorizzare grossi trasferimenti di denaro o rubare segreti industriali.\n\n### 3. Le nuove frontiere tecnologiche\n\n| Variante            | Descrizione                                                                                                                                                                                      | Livello di pericolo          |\n|---------------------|--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|------------------------------|\n| **Quishing**        | L'uso di **QR Code** malevoli. Scansionando il codice (es. su un finto parchimetro), l'utente viene inviato su un sito di pagamento clonato.                                                     | Alto (Difficile da filtrare) |\n| **Pharming**        | Non serve cliccare su un link. L'attaccante \"avvelena\" i server DNS o modifica il file hosts della vittima per reindirizzarla su un sito falso anche se digita l'URL corretto.                   | Molto Alto (Invisibile)      |\n| **Angler Phishing** | I criminali creano finti account di assistenza clienti sui social (es. @PosteItaliane_Supporto). Quando un utente scrive un reclamo pubblico, lo contattano in privato per rubargli i dati.      | Medio/Alto                   |\n| **SEO Phishing**    | L'attaccante usa tecniche di ottimizzazione o annunci a pagamento (Google Ads) per far apparire il proprio sito malevolo tra i primi risultati di ricerca per termini come \"Login [Nome Banca]\". | Alto                         |\n\n> **💡L'attacco omografo:** Sapevi che due URL possono sembrare identici ma portare a siti diversi?\nGrazie ai caratteri Unicode, un hacker può registrare un dominio come `pаypal.com`. Ad occhio nudo sembra corretto, ma la \"a\" è un carattere cirillico. Il browser lo interpreta come un indirizzo completamente diverso ($xn--pypal-4ve.com$), rendendo l'inganno quasi perfetto anche per l'occhio più esperto.\n\n## Conclusioni\n\nIn conclusione, il phishing ha smesso da tempo di essere un semplice tentativo di truffa via email per trasformarsi in un ecosistema complesso di inganni psicologici. Abbiamo visto come ogni variante — dallo Smishing al Quishing — sfrutti le nostre emozioni e la nostra quotidianità per spingerci a commettere un errore. Riconoscere l'esca è la prima, fondamentale linea di difesa: la consapevolezza è, a tutti gli effetti, il firewall più potente a nostra disposizione. Ma come riescono questi attacchi a superare i filtri tecnici? E cosa succede 'sotto il cofano' di un'email contraffatta? Lo scopriremo nella seconda parte di questa guida, dove analizzeremo l'anatomia tecnica del phishing e i protocolli necessari per blindare la nostra identità digitale.\n\n---\n\n*Se vuoi approfondire questi temi, hai domande su questo o altri argomenti, entra nella nostra community Discord: <i class=\"fab fa-discord\"></i><https://discord.gg/PE2q2jnNN6!>*\n",
      "draft": false,
      "featured": true
    }
  ]
}